reports/performance/load_test_summary.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: performance/load_test.js
        output: -

     scenarios: (100.00%) 1 scenario, 10 max VUs, 2m30s max duration (incl. graceful stop):
              * default: Up to 10 looping VUs for 2m0s over 3 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (0m01.0s), 01/10 VUs, 0 complete and 0 interrupted iterations
default   [   1% ] 01/10 VUs  0m01.0s/2m00.0s

running (0m02.0s), 01/10 VUs, 1 complete and 0 interrupted iterations
default   [   2% ] 01/10 VUs  0m02.0s/2m00.0s

running (0m03.0s), 01/10 VUs, 2 complete and 0 interrupted iterations
default   [   2% ] 01/10 VUs  0m03.0s/2m00.0s

running (0m04.0s), 01/10 VUs, 3 complete and 0 interrupted iterations
default   [   3% ] 01/10 VUs  0m04.0s/2m00.0s

running (0m05.0s), 01/10 VUs, 4 complete and 0 interrupted iterations
default   [   4% ] 01/10 VUs  0m05.0s/2m00.0s

running (0m06.0s), 01/10 VUs, 5 complete and 0 interrupted iterations
default   [   5% ] 01/10 VUs  0m06.0s/2m00.0s

running (0m07.0s), 01/10 VUs, 6 complete and 0 interrupted iterations
default   [   6% ] 01/10 VUs  0m07.0s/2m00.0s

running (0m08.0s), 02/10 VUs, 7 complete and 0 interrupted iterations
default   [   7% ] 02/10 VUs  0m08.0s/2m00.0s

running (0m09.0s), 02/10 VUs, 9 complete and 0 interrupted iterations
default   [   7% ] 02/10 VUs  0m09.0s/2m00.0s

running (0m10.0s), 02/10 VUs, 11 complete and 0 interrupted iterations
default   [   8% ] 02/10 VUs  0m10.0s/2m00.0s

running (0m11.0s), 02/10 VUs, 13 complete and 0 interrupted iterations
default   [   9% ] 02/10 VUs  0m11.0s/2m00.0s

running (0m12.0s), 02/10 VUs, 15 complete and 0 interrupted iterations
default   [  10% ] 02/10 VUs  0m12.0s/2m00.0s

running (0m13.0s), 02/10 VUs, 17 complete and 0 interrupted iterations
default   [  11% ] 02/10 VUs  0m13.0s/2m00.0s

running (0m14.0s), 02/10 VUs, 19 complete and 0 interrupted iterations
default   [  12% ] 02/10 VUs  0m14.0s/2m00.0s

running (0m15.0s), 02/10 VUs, 21 complete and 0 interrupted iterations
default   [  12% ] 02/10 VUs  0m15.0s/2m00.0s

running (0m16.0s), 03/10 VUs, 23 complete and 0 interrupted iterations
default   [  13% ] 03/10 VUs  0m16.0s/2m00.0s

running (0m17.0s), 03/10 VUs, 26 complete and 0 interrupted iterations
default   [  14% ] 03/10 VUs  0m17.0s/2m00.0s

running (0m18.0s), 03/10 VUs, 29 complete and 0 interrupted iterations
default   [  15% ] 03/10 VUs  0m18.0s/2m00.0s

running (0m19.0s), 03/10 VUs, 32 complete and 0 interrupted iterations
default   [  16% ] 03/10 VUs  0m19.0s/2m00.0s

running (0m20.0s), 03/10 VUs, 35 complete and 0 interrupted iterations
default   [  17% ] 03/10 VUs  0m20.0s/2m00.0s

running (0m21.0s), 03/10 VUs, 38 complete and 0 interrupted iterations
default   [  17% ] 03/10 VUs  0m21.0s/2m00.0s

running (0m22.0s), 03/10 VUs, 41 complete and 0 interrupted iterations
default   [  18% ] 03/10 VUs  0m22.0s/2m00.0s

running (0m23.0s), 04/10 VUs, 44 complete and 0 interrupted iterations
default   [  19% ] 04/10 VUs  0m23.0s/2m00.0s

running (0m24.0s), 04/10 VUs, 48 complete and 0 interrupted iterations
default   [  20% ] 04/10 VUs  0m24.0s/2m00.0s

running (0m25.0s), 04/10 VUs, 52 complete and 0 interrupted iterations
default   [  21% ] 04/10 VUs  0m25.0s/2m00.0s

running (0m26.0s), 04/10 VUs, 56 complete and 0 interrupted iterations
default   [  22% ] 04/10 VUs  0m26.0s/2m00.0s

running (0m27.0s), 04/10 VUs, 60 complete and 0 interrupted iterations
default   [  22% ] 04/10 VUs  0m27.0s/2m00.0s

running (0m28.0s), 04/10 VUs, 64 complete and 0 interrupted iterations
default   [  23% ] 04/10 VUs  0m28.0s/2m00.0s

running (0m29.0s), 04/10 VUs, 68 complete and 0 interrupted iterations
default   [  24% ] 04/10 VUs  0m29.0s/2m00.0s

running (0m30.0s), 04/10 VUs, 72 complete and 0 interrupted iterations
default   [  25% ] 04/10 VUs  0m30.0s/2m00.0s

running (0m31.0s), 05/10 VUs, 76 complete and 0 interrupted iterations
default   [  26% ] 05/10 VUs  0m31.0s/2m00.0s

running (0m32.0s), 05/10 VUs, 81 complete and 0 interrupted iterations
default   [  27% ] 05/10 VUs  0m32.0s/2m00.0s

running (0m33.0s), 05/10 VUs, 86 complete and 0 interrupted iterations
default   [  27% ] 05/10 VUs  0m33.0s/2m00.0s

running (0m34.0s), 05/10 VUs, 91 complete and 0 interrupted iterations
default   [  28% ] 05/10 VUs  0m34.0s/2m00.0s

running (0m35.0s), 05/10 VUs, 96 complete and 0 interrupted iterations
default   [  29% ] 05/10 VUs  0m35.0s/2m00.0s

running (0m36.0s), 05/10 VUs, 101 complete and 0 interrupted iterations
default   [  30% ] 05/10 VUs  0m36.0s/2m00.0s

running (0m37.0s), 05/10 VUs, 106 complete and 0 interrupted iterations
default   [  31% ] 05/10 VUs  0m37.0s/2m00.0s

running (0m38.0s), 05/10 VUs, 111 complete and 0 interrupted iterations
default   [  32% ] 05/10 VUs  0m38.0s/2m00.0s

running (0m39.0s), 05/10 VUs, 116 complete and 0 interrupted iterations
default   [  32% ] 05/10 VUs  0m39.0s/2m00.0s

running (0m40.0s), 05/10 VUs, 121 complete and 0 interrupted iterations
default   [  33% ] 05/10 VUs  0m40.0s/2m00.0s

running (0m41.0s), 05/10 VUs, 126 complete and 0 interrupted iterations
default   [  34% ] 05/10 VUs  0m41.0s/2m00.0s

running (0m42.0s), 05/10 VUs, 131 complete and 0 interrupted iterations
default   [  35% ] 05/10 VUs  0m42.0s/2m00.0s

running (0m43.0s), 06/10 VUs, 136 complete and 0 interrupted iterations
default   [  36% ] 06/10 VUs  0m43.0s/2m00.0s

running (0m44.0s), 06/10 VUs, 142 complete and 0 interrupted iterations
default   [  37% ] 06/10 VUs  0m44.0s/2m00.0s

running (0m45.0s), 06/10 VUs, 148 complete and 0 interrupted iterations
default   [  37% ] 06/10 VUs  0m45.0s/2m00.0s

running (0m46.0s), 06/10 VUs, 154 complete and 0 interrupted iterations
default   [  38% ] 06/10 VUs  0m46.0s/2m00.0s

running (0m47.0s), 06/10 VUs, 160 complete and 0 interrupted iterations
default   [  39% ] 06/10 VUs  0m47.0s/2m00.0s

running (0m48.0s), 06/10 VUs, 166 complete and 0 interrupted iterations
default   [  40% ] 06/10 VUs  0m48.0s/2m00.0s

running (0m49.0s), 06/10 VUs, 172 complete and 0 interrupted iterations
default   [  41% ] 06/10 VUs  0m49.0s/2m00.0s

running (0m50.0s), 06/10 VUs, 178 complete and 0 interrupted iterations
default   [  42% ] 06/10 VUs  0m50.0s/2m00.0s

running (0m51.0s), 06/10 VUs, 183 complete and 0 interrupted iterations
default   [  42% ] 06/10 VUs  0m51.0s/2m00.0s

running (0m52.0s), 06/10 VUs, 189 complete and 0 interrupted iterations
default   [  43% ] 06/10 VUs  0m52.0s/2m00.0s

running (0m53.0s), 06/10 VUs, 195 complete and 0 interrupted iterations
default   [  44% ] 06/10 VUs  0m53.0s/2m00.0s

running (0m54.0s), 06/10 VUs, 201 complete and 0 interrupted iterations
default   [  45% ] 06/10 VUs  0m54.0s/2m00.0s

running (0m55.0s), 07/10 VUs, 207 complete and 0 interrupted iterations
default   [  46% ] 07/10 VUs  0m55.0s/2m00.0s

running (0m56.0s), 07/10 VUs, 214 complete and 0 interrupted iterations
default   [  47% ] 07/10 VUs  0m56.0s/2m00.0s

running (0m57.0s), 07/10 VUs, 221 complete and 0 interrupted iterations
default   [  47% ] 07/10 VUs  0m57.0s/2m00.0s

running (0m58.0s), 07/10 VUs, 228 complete and 0 interrupted iterations
default   [  48% ] 07/10 VUs  0m58.0s/2m00.0s

running (0m59.0s), 07/10 VUs, 235 complete and 0 interrupted iterations
default   [  49% ] 07/10 VUs  0m59.0s/2m00.0s

running (1m00.0s), 07/10 VUs, 242 complete and 0 interrupted iterations
default   [  50% ] 07/10 VUs  1m00.0s/2m00.0s

running (1m01.0s), 07/10 VUs, 249 complete and 0 interrupted iterations
default   [  51% ] 07/10 VUs  1m01.0s/2m00.0s

running (1m02.0s), 07/10 VUs, 256 complete and 0 interrupted iterations
default   [  52% ] 07/10 VUs  1m02.0s/2m00.0s

running (1m03.0s), 07/10 VUs, 263 complete and 0 interrupted iterations
default   [  52% ] 07/10 VUs  1m03.0s/2m00.0s

running (1m04.0s), 07/10 VUs, 270 complete and 0 interrupted iterations
default   [  53% ] 07/10 VUs  1m04.0s/2m00.0s

running (1m05.0s), 07/10 VUs, 277 complete and 0 interrupted iterations
default   [  54% ] 07/10 VUs  1m05.0s/2m00.0s

running (1m06.0s), 07/10 VUs, 284 complete and 0 interrupted iterations
default   [  55% ] 07/10 VUs  1m06.0s/2m00.0s

running (1m07.0s), 08/10 VUs, 291 complete and 0 interrupted iterations
default   [  56% ] 08/10 VUs  1m07.0s/2m00.0s

running (1m08.0s), 08/10 VUs, 299 complete and 0 interrupted iterations
default   [  57% ] 08/10 VUs  1m08.0s/2m00.0s

running (1m09.0s), 08/10 VUs, 307 complete and 0 interrupted iterations
default   [  57% ] 08/10 VUs  1m09.0s/2m00.0s

running (1m10.0s), 08/10 VUs, 314 complete and 0 interrupted iterations
default   [  58% ] 08/10 VUs  1m10.0s/2m00.0s

running (1m11.0s), 08/10 VUs, 322 complete and 0 interrupted iterations
default   [  59% ] 08/10 VUs  1m11.0s/2m00.0s

running (1m12.0s), 08/10 VUs, 330 complete and 0 interrupted iterations
default   [  60% ] 08/10 VUs  1m12.0s/2m00.0s

running (1m13.0s), 08/10 VUs, 338 complete and 0 interrupted iterations
default   [  61% ] 08/10 VUs  1m13.0s/2m00.0s

running (1m14.0s), 08/10 VUs, 346 complete and 0 interrupted iterations
default   [  62% ] 08/10 VUs  1m14.0s/2m00.0s

running (1m15.0s), 08/10 VUs, 354 complete and 0 interrupted iterations
default   [  62% ] 08/10 VUs  1m15.0s/2m00.0s

running (1m16.0s), 08/10 VUs, 362 complete and 0 interrupted iterations
default   [  63% ] 08/10 VUs  1m16.0s/2m00.0s

running (1m17.0s), 08/10 VUs, 370 complete and 0 interrupted iterations
default   [  64% ] 08/10 VUs  1m17.0s/2m00.0s

running (1m18.0s), 08/10 VUs, 378 complete and 0 interrupted iterations
default   [  65% ] 08/10 VUs  1m18.0s/2m00.0s

running (1m19.0s), 09/10 VUs, 386 complete and 0 interrupted iterations
default   [  66% ] 09/10 VUs  1m19.0s/2m00.0s

running (1m20.0s), 09/10 VUs, 395 complete and 0 interrupted iterations
default   [  67% ] 09/10 VUs  1m20.0s/2m00.0s

running (1m21.0s), 09/10 VUs, 404 complete and 0 interrupted iterations
default   [  67% ] 09/10 VUs  1m21.0s/2m00.0s

running (1m22.0s), 09/10 VUs, 413 complete and 0 interrupted iterations
default   [  68% ] 09/10 VUs  1m22.0s/2m00.0s

running (1m23.0s), 09/10 VUs, 422 complete and 0 interrupted iterations
default   [  69% ] 09/10 VUs  1m23.0s/2m00.0s

running (1m24.0s), 09/10 VUs, 431 complete and 0 interrupted iterations
default   [  70% ] 09/10 VUs  1m24.0s/2m00.0s

running (1m25.0s), 09/10 VUs, 440 complete and 0 interrupted iterations
default   [  71% ] 09/10 VUs  1m25.0s/2m00.0s

running (1m26.0s), 09/10 VUs, 449 complete and 0 interrupted iterations
default   [  72% ] 09/10 VUs  1m26.0s/2m00.0s

running (1m27.0s), 09/10 VUs, 458 complete and 0 interrupted iterations
default   [  72% ] 09/10 VUs  1m27.0s/2m00.0s

running (1m28.0s), 09/10 VUs, 467 complete and 0 interrupted iterations
default   [  73% ] 09/10 VUs  1m28.0s/2m00.0s

running (1m29.0s), 09/10 VUs, 476 complete and 0 interrupted iterations
default   [  74% ] 09/10 VUs  1m29.0s/2m00.0s

running (1m30.0s), 09/10 VUs, 485 complete and 0 interrupted iterations
default   [  75% ] 09/10 VUs  1m30.0s/2m00.0s

running (1m31.0s), 10/10 VUs, 494 complete and 0 interrupted iterations
default   [  76% ] 10/10 VUs  1m31.0s/2m00.0s

running (1m32.0s), 10/10 VUs, 504 complete and 0 interrupted iterations
default   [  77% ] 10/10 VUs  1m32.0s/2m00.0s

running (1m33.0s), 10/10 VUs, 514 complete and 0 interrupted iterations
default   [  77% ] 10/10 VUs  1m33.0s/2m00.0s

running (1m34.0s), 09/10 VUs, 523 complete and 0 interrupted iterations
default   [  78% ] 09/10 VUs  1m34.0s/2m00.0s

running (1m35.0s), 09/10 VUs, 532 complete and 0 interrupted iterations
default   [  79% ] 09/10 VUs  1m35.0s/2m00.0s

running (1m36.0s), 09/10 VUs, 541 complete and 0 interrupted iterations
default   [  80% ] 09/10 VUs  1m36.0s/2m00.0s

running (1m37.0s), 08/10 VUs, 550 complete and 0 interrupted iterations
default   [  81% ] 08/10 VUs  1m37.0s/2m00.0s

running (1m38.0s), 08/10 VUs, 558 complete and 0 interrupted iterations
default   [  82% ] 08/10 VUs  1m38.0s/2m00.0s

running (1m39.0s), 08/10 VUs, 566 complete and 0 interrupted iterations
default   [  82% ] 08/10 VUs  1m39.0s/2m00.0s

running (1m40.0s), 07/10 VUs, 574 complete and 0 interrupted iterations
default   [  83% ] 07/10 VUs  1m40.0s/2m00.0s

running (1m41.0s), 07/10 VUs, 581 complete and 0 interrupted iterations
default   [  84% ] 07/10 VUs  1m41.0s/2m00.0s

running (1m42.0s), 07/10 VUs, 588 complete and 0 interrupted iterations
default   [  85% ] 07/10 VUs  1m42.0s/2m00.0s

running (1m43.0s), 06/10 VUs, 595 complete and 0 interrupted iterations
default   [  86% ] 06/10 VUs  1m43.0s/2m00.0s

running (1m44.0s), 06/10 VUs, 601 complete and 0 interrupted iterations
default   [  87% ] 06/10 VUs  1m44.0s/2m00.0s

running (1m45.0s), 06/10 VUs, 607 complete and 0 interrupted iterations
default   [  87% ] 06/10 VUs  1m45.0s/2m00.0s

running (1m46.0s), 05/10 VUs, 613 complete and 0 interrupted iterations
default   [  88% ] 05/10 VUs  1m46.0s/2m00.0s

running (1m47.0s), 05/10 VUs, 618 complete and 0 interrupted iterations
default   [  89% ] 05/10 VUs  1m47.0s/2m00.0s

running (1m48.0s), 05/10 VUs, 623 complete and 0 interrupted iterations
default   [  90% ] 05/10 VUs  1m48.0s/2m00.0s

running (1m49.0s), 04/10 VUs, 628 complete and 0 interrupted iterations
default   [  91% ] 04/10 VUs  1m49.0s/2m00.0s

running (1m50.0s), 04/10 VUs, 632 complete and 0 interrupted iterations
default   [  92% ] 04/10 VUs  1m50.0s/2m00.0s

running (1m51.0s), 04/10 VUs, 636 complete and 0 interrupted iterations
default   [  92% ] 04/10 VUs  1m51.0s/2m00.0s

running (1m52.0s), 03/10 VUs, 639 complete and 0 interrupted iterations
default   [  93% ] 03/10 VUs  1m52.0s/2m00.0s

running (1m53.0s), 03/10 VUs, 642 complete and 0 interrupted iterations
default   [  94% ] 03/10 VUs  1m53.0s/2m00.0s

running (1m54.0s), 03/10 VUs, 645 complete and 0 interrupted iterations
default   [  95% ] 03/10 VUs  1m54.0s/2m00.0s

running (1m55.0s), 02/10 VUs, 648 complete and 0 interrupted iterations
default   [  96% ] 02/10 VUs  1m55.0s/2m00.0s

running (1m56.0s), 02/10 VUs, 650 complete and 0 interrupted iterations
default   [  97% ] 02/10 VUs  1m56.0s/2m00.0s

running (1m57.0s), 02/10 VUs, 652 complete and 0 interrupted iterations
default   [  97% ] 02/10 VUs  1m57.0s/2m00.0s

running (1m58.0s), 01/10 VUs, 654 complete and 0 interrupted iterations
default   [  98% ] 01/10 VUs  1m58.0s/2m00.0s

running (1m59.0s), 01/10 VUs, 655 complete and 0 interrupted iterations
default   [  99% ] 01/10 VUs  1m59.0s/2m00.0s

running (2m00.0s), 01/10 VUs, 656 complete and 0 interrupted iterations
default   [ 100% ] 01/10 VUs  2m00.0s/2m00.0s


  █ THRESHOLDS 

    http_req_duration
    ✓ 'p(95)<800' p(95)=5.85ms

    http_req_failed
    ✓ 'rate<0.05' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 1971    16.391359/s
    checks_succeeded...: 100.00% 1971 out of 1971
    checks_failed......: 0.00%   0 out of 1971

    ✓ home page status is 200
    ✓ login page status is 200
    ✓ register page status is 200

    HTTP
    http_req_duration..............: avg=2.96ms min=613µs med=2.7ms p(90)=4.86ms p(95)=5.85ms p(99)=7.27ms max=35.69ms
      { expected_response:true }...: avg=2.96ms min=613µs med=2.7ms p(90)=4.86ms p(95)=5.85ms p(99)=7.27ms max=35.69ms
    http_req_failed................: 0.00%  0 out of 1971
    http_reqs......................: 1971   16.391359/s

    EXECUTION
    iteration_duration.............: avg=1.01s  min=1s    med=1.01s p(90)=1.01s  p(95)=1.01s  p(99)=1.02s  max=1.07s  
    iterations.....................: 657    5.463786/s
    vus............................: 1      min=1         max=10
    vus_max........................: 10     min=10        max=10

    NETWORK
    data_received..................: 7.6 MB 63 kB/s
    data_sent......................: 194 kB 1.6 kB/s



running (2m00.2s), 00/10 VUs, 657 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/10 VUs  2m0s